In [11]:
import pandas as pd

In [12]:
a={'india':{'telangana':{'hyderabad':'ameerpet'}}}

In [13]:
a['india']

{'telangana': {'hyderabad': 'ameerpet'}}

In [38]:
left=pd.DataFrame([['a',1],['b',2]],list("AB"))

In [39]:
left

   0  1
A  a  1
B  b  2

In [40]:
left=pd.DataFrame([['a',1],['b',2]],['x','y'],['A','B'])

In [41]:
left

   A  B
x  a  1
y  b  2

In [42]:
left=pd.DataFrame([['a',1],['b',2]],[['X0','Y0'],['A0','B0']])

In [43]:
left

       0  1
X0 A0  a  1
Y0 B0  b  2

In [44]:
left=pd.DataFrame([['a',1],['b',2]],[['X0','Y0'],['A0','B0']],[['x1','y1'],['A1','B1']])

In [45]:
left

      x1 y1
      A1 B1
X0 A0  a  1
Y0 B0  b  2

In [46]:
df=pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                'col2':[444,555,666,777,888,999,111,222,333,666],
                'col3':'a b c d e f g h i j'
                })

In [47]:
df

   col1  col2                 col3
0     1   444  a b c d e f g h i j
1     2   555  a b c d e f g h i j
2     3   666  a b c d e f g h i j
3     4   777  a b c d e f g h i j
4     5   888  a b c d e f g h i j
5     6   999  a b c d e f g h i j
6     7   111  a b c d e f g h i j
7     8   222  a b c d e f g h i j
8     9   333  a b c d e f g h i j
9    10   666  a b c d e f g h i j

In [49]:
df=pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                'col2':[444,555,666,777,888,999,111,222,333,666],
                'col3':'a'
                })

In [50]:
df

   col1  col2 col3
0     1   444    a
1     2   555    a
2     3   666    a
3     4   777    a
4     5   888    a
5     6   999    a
6     7   111    a
7     8   222    a
8     9   333    a
9    10   666    a

In [51]:
df=pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                'col2':[444,555,666,777,888,999,111,222,333,666],
                'col3':1
                })

In [52]:
df

   col1  col2  col3
0     1   444     1
1     2   555     1
2     3   666     1
3     4   777     1
4     5   888     1
5     6   999     1
6     7   111     1
7     8   222     1
8     9   333     1
9    10   666     1

1.required arguments

In [53]:
def dis (a,b):
    print(a,b)

In [54]:
dis(10,20)

10 20

2.key word arguments

In [55]:
dis(b=30,a=20)

20 30

3.default arguments

In [56]:
def dis(name='john',course='ai'):
    print(name)
    print(course)

In [57]:
dis(name='venu')

venu
ai

4.variable length arguments

In [58]:
def dis(*courses):
    for i in range(3):
        print(courses)

In [59]:
dis('python','artificial intelligence','machine learning','deep learning')

('python', 'artificial intelligence', 'machine learning', 'deep learning')
('python', 'artificial intelligence', 'machine learning', 'deep learning')
('python', 'artificial intelligence', 'machine learning', 'deep learning')

In [60]:
def dis(*courses):
    print('today is monday')
    return courses

In [61]:
dis('python','artificial intelligence','machine learning','deep learning')

today is monday

('python', 'artificial intelligence', 'machine learning', 'deep learning')

In [17]:
#060819
def testfunc(x):
    if(x>500):
        return(10*np.log10(x))
    else:
        return(x/10)

In [24]:
import pandas as pd
import numpy as np

In [25]:
df=pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                'col2':[444,555,666,777,888,999,111,222,333,666],
                })

In [26]:
df

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   777
4     5   888
5     6   999
6     7   111
7     8   222
8     9   333
9    10   666

In [30]:
df['FuncApplied']=df['col1'].apply(testfunc)

In [31]:
df

   col1  col2  FuncApplied
0     1   444          0.1
1     2   555          0.2
2     3   666          0.3
3     4   777          0.4
4     5   888          0.5
5     6   999          0.6
6     7   111          0.7
7     8   222          0.8
8     9   333          0.9
9    10   666          1.0

In [28]:
df['FuncApplied']=df['col2'].apply(testfunc)

In [29]:
df

   col1  col2  FuncApplied
0     1   444    44.400000
1     2   555    27.442930
2     3   666    28.234742
3     4   777    28.904210
4     5   888    29.484130
5     6   999    29.995655
6     7   111    11.100000
7     8   222    22.200000
8     9   333    33.300000
9    10   666    28.234742

In [36]:
df['col3length']=df['col3'].apply(len)

In [37]:
df

   col1  col2  FuncApplied  col3  col3length
0     1   444          0.1    aa           2
1     2   555          0.2   bbb           3
2     3   666          0.3   ccc           3
3     4   777          0.4  dddd           4
4     5   888          0.5  eeee           4
5     6   999          0.6  ffff           4
6     7   111          0.7  qqqq           4
7     8   222          0.8   www           3
8     9   333          0.9   rrr           3
9    10   666          1.0   ttt           3

In [34]:
df['col3']='aa bbb ccc dddd eeee ffff qqqq www rrr ttt'.split()

In [35]:
df

   col1  col2  FuncApplied  col3
0     1   444          0.1    aa
1     2   555          0.2   bbb
2     3   666          0.3   ccc
3     4   777          0.4  dddd
4     5   888          0.5  eeee
5     6   999          0.6  ffff
6     7   111          0.7  qqqq
7     8   222          0.8   www
8     9   333          0.9   rrr
9    10   666          1.0   ttt

In [68]:
a=lambda x,y=1:[x+y,x-y,x*y,x/y]

In [69]:
a(6,8)

[14, -2, 48, 0.75]

In [70]:
b=lambda x,y,z:[x*y,x+y+z,z*x-y]

In [71]:
b(3,4,5)

[12, 12, 11]

In [72]:
b

In [73]:
(lambda x,y,z=3:x+y+z)(1,y=2)

6